Конфигурация/Catalogs/ВизыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>ВизыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещенияВИсторию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Согласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоместилВИсторию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенаВИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановилРезультат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Резолюции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Резолюции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАвторРезолюции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесРезолюцию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезолюции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДополнительныйОбъектАдресацииАвтора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Рассмотрение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсновнойОбъектАдресацииАвтора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстРезолюции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторРезолюции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/АдреснаяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>АдреснаяКнига</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыЛичныхАдресатов</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВАдреснойКниге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОбъектаВСписке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительОбъекта</Name>
					<Comment>Реквизит предназначен для вычисления доступа к записи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанныхОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхАдреснойКниги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/УдалениеОбъектовПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает массив всех возможных типов связанных объектов
//
Функция ПолучитьТипыСвязанныхОбъектов() Экспорт
	
	МетаданныеСвязанныхОбъектов = Новый Массив;
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.ВизыСогласования);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.Резолюции);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.УведомленияПрограммы);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.АдреснаяКнига);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Документы.ВходящееСообщениеСВД);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Документы.ИсходящееСообщениеСВД);
	
	Возврат МетаданныеСвязанныхОбъектов;
	
КонецФункции
	
// Находит объекты, которые согласно прикладной логике должны быть удалены 
// вместе с выбранными удаляемыми объектами
//
// Параметры:
// УдаляемыеОбъекты - Массив - массив удаляемых объектов
//
Функция ПолучитьТаблицуСвязанныхОбъектов(УдаляемыеОбъекты) Экспорт
	
	ТаблицаСвязанных = Новый ТаблицаЗначений;
	ТаблицаСвязанных.Колонки.Добавить("УдаляемыйОбъект");
	ТаблицаСвязанных.Колонки.Добавить("СвязанныйОбъект");
	ТаблицаСвязанных.Колонки.Добавить("ПометкаУдаленияСвязанного");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УдаляемыеОбъекты", УдаляемыеОбъекты);
	
	ДобавитьСвязанныеВизыСогласования(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеРезолюции(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеУведомленияПрограммы(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеЗаписиАдреснойКниги(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеСообщенияСВД(Запрос, ТаблицаСвязанных);
	
	ТаблицаСвязанных.Свернуть("УдаляемыйОбъект, СвязанныйОбъект, ПометкаУдаленияСвязанного");
	
	Возврат ТаблицаСвязанных;
	
КонецФункции

// Удаляет записи регистров, имеющие ссылки на удаляемые объекты
// Параметры:
//  УдаляемыеОбъекты - массив удаляемых объектов
//
Процедура УдалитьДанныеСвязанныхРегистров(УдаляемыеОбъекты) Экспорт
	
	// ФактическиеТрудозатраты
	ИмяРегистра = "ФактическиеТрудозатраты";
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить("ЕжедневныйОтчет");
	УдалениеОбъектов.УдалитьДанныеСвязанногоРегистра(ИмяРегистра, ПоляПоиска, УдаляемыеОбъекты);
	
	// ПроизошедшиеБизнесСобытия
	ИмяРегистра = "ПроизошедшиеБизнесСобытия";
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить("Источник");
	УдалениеОбъектов.УдалитьДанныеСвязанногоРегистра(ИмяРегистра, ПоляПоиска, УдаляемыеОбъекты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Визы согласования по источнику и документу
Процедура ДобавитьСвязанныеВизыСогласования(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВизыСогласования.Источник КАК УдаляемыйОбъект,
		|	ВизыСогласования.Ссылка КАК СвязанныйОбъект,
		|	ВизыСогласования.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.ВизыСогласования КАК ВизыСогласования
		|ГДЕ
		|	ВизыСогласования.Источник В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВизыСогласования.Документ,
		|	ВизыСогласования.Ссылка,
		|	ВизыСогласования.ПометкаУдаления
		|ИЗ
		|	Справочник.ВизыСогласования КАК ВизыСогласования
		|ГДЕ
		|	ВизыСогласования.Документ В(&УдаляемыеОбъекты)";
	
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры	

// Резолюции по источнику и документу
Процедура ДобавитьСвязанныеРезолюции(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Резолюции.Источник КАК УдаляемыйОбъект,
		|	Резолюции.Ссылка КАК СвязанныйОбъект,
		|	Резолюции.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции
		|ГДЕ
		|	Резолюции.Источник В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Резолюции.Документ,
		|	Резолюции.Ссылка,
		|	Резолюции.ПометкаУдаления
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции
		|ГДЕ
		|	Резолюции.Документ В(&УдаляемыеОбъекты)";
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры	

// Уведомления программы по объектам
Процедура ДобавитьСвязанныеУведомленияПрограммы(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияПрограммы.Объект КАК УдаляемыйОбъект,
		|	УведомленияПрограммы.Ссылка КАК СвязанныйОбъект,
		|	УведомленияПрограммы.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Объект В(&УдаляемыеОбъекты)";
		
		
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры

// Адресная книга
Процедура ДобавитьСвязанныеЗаписиАдреснойКниги(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдреснаяКнига.Объект КАК УдаляемыйОбъект,
		|	АдреснаяКнига.Ссылка КАК СвязанныйОбъект,
		|	АдреснаяКнига.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.АдреснаяКнига КАК АдреснаяКнига
		|ГДЕ
		|	АдреснаяКнига.Объект В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АдреснаяКнига.ОбъектДоступа,
		|	АдреснаяКнига.Ссылка,
		|	АдреснаяКнига.ПометкаУдаления
		|ИЗ
		|	Справочник.АдреснаяКнига КАК АдреснаяКнига
		|ГДЕ
		|	АдреснаяКнига.Объект В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АдреснаяКнига.РодительОбъекта,
		|	АдреснаяКнига.Ссылка,
		|	АдреснаяКнига.ПометкаУдаления
		|ИЗ
		|	Справочник.АдреснаяКнига КАК АдреснаяКнига
		|ГДЕ
		|	АдреснаяКнига.Объект В(&УдаляемыеОбъекты)";
		
		
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры

// Добавляет строки результата запроса к переданной таблице связанных объектов
Процедура ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных)
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСвязанных.Добавить(), Выборка);
	КонецЦикла;	
		
КонецПроцедуры

// Сообщения СВД по документу
Процедура ДобавитьСвязанныеСообщенияСВД(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящееСообщениеСВД.Документ КАК УдаляемыйОбъект,
		|	ВходящееСообщениеСВД.Ссылка КАК СвязанныйОбъект,
		|	ВходящееСообщениеСВД.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Документ.ВходящееСообщениеСВД КАК ВходящееСообщениеСВД
		|ГДЕ
		|	ВходящееСообщениеСВД.Документ В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсходящееСообщениеСВД.Документ,
		|	ИсходящееСообщениеСВД.Ссылка,
		|	ИсходящееСообщениеСВД.ПометкаУдаления
		|ИЗ
		|	Документ.ИсходящееСообщениеСВД КАК ИсходящееСообщениеСВД
		|ГДЕ
		|	ИсходящееСообщениеСВД.Документ В(&УдаляемыеОбъекты)";
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры

#КонецОбласти
